pandas : 표형태의 데이터를 분석. 저장

DataFrame :  행(row, record),열(column, field)이루어짐. 2차원형태의 데이터
             Series 데이터의 모임
Series : 1차원형태의 데이터. 벡터

In [2]:
import pandas as pd #pip install pandas

In [3]:
#딕셔너리 데이터를 Series 데이터로 생성하기
dict_data = {'a':1,'b':2,'c':3}
sr = pd.Series(dict_data)
print(sr)
print(sr.values)

a    1
b    2
c    3
dtype: int64
[1 2 3]

In [9]:
#튜플데이터를 Series 데이터로 생성하기
tuple_data = ("홍길동","1990-01-01", '남',True,30)
sr = pd.Series(tuple_data,index=["이름","생일","성별","학생여부","나이"])
print(sr)
#인덱스값만 조회하기
print(sr.index)
#값만 조회하기
print(sr.values)

이름             홍길동
생일      1990-01-01
성별               남
학생여부          True
나이              30
dtype: object
Index(['이름', '생일', '성별', '학생여부', '나이'], dtype='object')
['홍길동' '1990-01-01' '남' True 30]

In [13]:
print(sr[0])  #i-index. 순서. 0부터시작
print(sr["이름"]) #인덱스
print(sr.이름) #인덱스
print(sr[1])  #i-index. 순서. 0부터시작
print(sr["생일"]) #인덱스
print(sr.생일) #인덱스

홍길동
홍길동
홍길동
1990-01-01
1990-01-01
1990-01-01

C:\Users\123rl\AppData\Local\Temp\ipykernel_8572\220494420.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[0])  #i-index. 순서. 0부터시작
C:\Users\123rl\AppData\Local\Temp\ipykernel_8572\220494420.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[1])  #i-index. 순서. 0부터시작

In [18]:
#여러개의 값 조회
print(sr[[0,1]])
#print(sr[0,1])  #오류
print(sr[["이름","생일"]])

이름           홍길동
생일    1990-01-01
dtype: object
이름           홍길동
생일    1990-01-01
dtype: object

C:\Users\123rl\AppData\Local\Temp\ipykernel_8572\1699553211.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[[0,1]])

In [22]:
#여러개의 값을 범위를 지정하여 조회
print(sr)
print(sr[0:3])  #순서로 조회. 0~2번째 순서 Series[첫번째순서:마지막순서+1]
print(sr["이름":"성별"])  #순서로 조회. 이름~성별 순서 Series[첫번째인덱스:마지막인덱스]

이름             홍길동
생일      1990-01-01
성별               남
학생여부          True
나이              30
dtype: object
이름           홍길동
생일    1990-01-01
성별             남
dtype: object
이름           홍길동
생일    1990-01-01
성별             남
dtype: object

In [25]:
#데이터프레임 객체 생성하기
#딕셔너리 이용
dict_data = {"c0":[1,2,3],"c1":[4,5,6],"c2":[7,8,9],"c3":[10,11,12],"c4":[13,14,15]}
df = pd.DataFrame(dict_data)
print(df)
print("컬럼명:",df.columns)
print("인덱스명:",df.index)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15
컬럼명: Index(['c0', 'c1', 'c2', 'c3', 'c4'], dtype='object')
인덱스명: RangeIndex(start=0, stop=3, step=1)

In [28]:
print(df["c0"])  #컬럼명으로 조회. 
print(type(df["c0"]))  #Series 데이터
print(df.c0)  #컬럼명으로 조회.

0    1
1    2
2    3
Name: c0, dtype: int64
<class 'pandas.core.series.Series'>
0    1
1    2
2    3
Name: c0, dtype: int64

In [32]:
#여러개의 컬럼 조회
print(df[["c0","c3"]])
print(type(df[["c0","c3"]]))
print(df[["c0"]])
print(type(df[["c0"]]))

   c0  c3
0   1  10
1   2  11
2   3  12
<class 'pandas.core.frame.DataFrame'>
   c0
0   1
1   2
2   3
<class 'pandas.core.frame.DataFrame'>

In [35]:
#리스트를 이용하여 데이터프레임 객체 생성
df = pd.DataFrame([[15,"남","서울중"],[17,"여","서울여고"],[17,"남","서울고"]],\
                  index=["홍길동","성춘향","이몽룡"],columns=["나이","성별","학교"])
print(df)
print("컬럼명:",df.columns)
print("인덱스명:",df.index)

     나이 성별    학교
홍길동  15  남   서울중
성춘향  17  여  서울여고
이몽룡  17  남   서울고
컬럼명: Index(['나이', '성별', '학교'], dtype='object')
인덱스명: Index(['홍길동', '성춘향', '이몽룡'], dtype='object')

In [37]:
#인덱스 변경하기
df.index = ["학생1","학생2","학생3"]
print(df)
#컬럼명 변경하기
df.columns=["age","gender","school"]
print(df)

     나이 성별    학교
학생1  15  남   서울중
학생2  17  여  서울여고
학생3  17  남   서울고
     age gender school
학생1   15      남    서울중
학생2   17      여   서울여고
학생3   17      남    서울고

In [39]:
#컬럼명의 일부만 수정하기
#inplace=True : 객체 자체를 변경
df.rename(columns={"age":"나이"},inplace=True)
print(df)

     나이 gender school
학생1  15      남    서울중
학생2  17      여   서울여고
학생3  17      남    서울고

In [41]:
df=df.rename(columns={"나이":"age"}) #inplace=True 를 사용하지 않으면 df에 대입하면 됨
print(df)

     age gender school
학생1   15      남    서울중
학생2   17      여   서울여고
학생3   17      남    서울고

In [43]:
#문제 : exam_data를 이용하여 인덱스는 홍길동,이몽룡,김삿갓인 DataFrame 객체 생성하기
exam_data={"수학":[90,80,70],"영어":[98,88,95],"음악":[85,95,100],"체육":[100,90,90]}
#1
df = pd.DataFrame(exam_data,index=["홍길동","이몽룡","김삿갓"])
print(df)
#2
df = pd.DataFrame(exam_data)
df.index=["홍길동","이몽룡","김삿갓"]
print(df)

     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90
     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90

In [46]:
#평균 구하기
print(df.mean())
print(type(df.mean()))

수학    80.000000
영어    93.666667
음악    93.333333
체육    93.333333
dtype: float64
<class 'pandas.core.series.Series'>

In [50]:
#수학평균
print("수학평균:",df.mean()["수학"])
print("수학평균:",df.mean().수학)
print("수학평균:",df.mean()[0])
print("수학평균:",df["수학"].mean())
print("수학평균:",df.수학.mean())

수학평균: 80.0
수학평균: 80.0
수학평균: 80.0
수학평균: 80.0
수학평균: 80.0

C:\Users\123rl\AppData\Local\Temp\ipykernel_8572\2633141806.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print("수학평균:",df.mean()[0])

In [51]:
#총점 : df.sum() 
print(df.sum())

수학    240
영어    281
음악    280
체육    280
dtype: int64

In [53]:
#수학 총점
print(df.sum()["수학"])
print(df["수학"].sum())

240
240

In [56]:
#최대점수 출력
print(df.max())
#수학최대점수
print(df.max()["수학"])
#최소점수 출력
print(df.min())
#수학최소점수
print(df.min()["수학"])

수학     90
영어     98
음악    100
체육    100
dtype: int64
90
수학    70
영어    88
음악    85
체육    90
dtype: int64
70

In [58]:
#중간값 : median.
# 데이터의 중간값 : 홀수 : 가운데값, 짝수:가운데값2의 평균
print(df)
print(df.median())

     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90
수학    80.0
영어    95.0
음악    95.0
체육    90.0
dtype: float64

In [61]:
print(df.수학.홍길동) #홍길동의 수학 점수 조회
#데이터프레임의 인덱스값조회하기
# loc[인덱스]
# iloc[순서]
#홍길동 데이터 조회하기
print(df.loc["홍길동"]) #인덱스 이름 홍길동인 행 조회
print(df.iloc[0])      # 첫번째 행 조회

90
수학     90
영어     98
음악     85
체육    100
Name: 홍길동, dtype: int64
수학     90
영어     98
음악     85
체육    100
Name: 홍길동, dtype: int64

In [64]:
#홍길동, 김삿갓의 정보 조회하기
print(df.loc[["홍길동","김삿갓"]])
print(df.iloc[[0,2]])

     수학  영어   음악   체육
홍길동  90  98   85  100
김삿갓  70  95  100   90
     수학  영어   음악   체육
홍길동  90  98   85  100
김삿갓  70  95  100   90

In [66]:
#홍길동의 평균,총점 출력하기
print("홍길동의 평균:",df.loc["홍길동"].mean())
print("홍길동의 총점:",df.loc["홍길동"].sum())

홍길동의 평균: 93.25
홍길동의 총점: 373

In [83]:
#모든 학생의 평균 출력하기
print(df.mean(axis="columns")) #행기준 평균
print(df.mean(axis=1))         #행기준 평균
print(df.mean(axis="index"))   #열기준 평균
print(df.mean(axis=0))         #열기준 평균. 기본값
print(df.mean())         #열기준 평균

홍길동    93.25
이몽룡    88.25
김삿갓    88.75
dtype: float64
홍길동    93.25
이몽룡    88.25
김삿갓    88.75
dtype: float64
수학    80.000000
영어    93.666667
음악    93.333333
체육    93.333333
dtype: float64
수학    80.000000
영어    93.666667
음악    93.333333
체육    93.333333
dtype: float64
수학    80.000000
영어    93.666667
음악    93.333333
체육    93.333333
dtype: float64

In [86]:
#표준편차 : std, 분산 : var
# 분산 : (평균값 - 현재값) ** 2 의 합의 평균
# 표준편차 : sqrt(분산)
print(df.std())
print(df.var())

수학    10.000000
영어     5.131601
음악     7.637626
체육     5.773503
dtype: float64
수학    100.000000
영어     26.333333
음악     58.333333
체육     33.333333
dtype: float64

In [87]:
#기술통계 : 기본적인 수치데이트 분석
df.describe()

         수학         영어          음악          체육
count   3.0   3.000000    3.000000    3.000000
mean   80.0  93.666667   93.333333   93.333333
std    10.0   5.131601    7.637626    5.773503
min    70.0  88.000000   85.000000   90.000000
25%    75.0  91.500000   90.000000   90.000000
50%    80.0  95.000000   95.000000   90.000000
75%    85.0  96.500000   97.500000   95.000000
max    90.0  98.000000  100.000000  100.000000

In [89]:
#dataframe의 기본 정보
df.info()
df.수학.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 홍길동 to 김삿갓
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   수학      3 non-null      int64
 1   영어      3 non-null      int64
 2   음악      3 non-null      int64
 3   체육      3 non-null      int64
dtypes: int64(4)
memory usage: 228.0+ bytes
<class 'pandas.core.series.Series'>
Index: 3 entries, 홍길동 to 김삿갓
Series name: 수학
Non-Null Count  Dtype
--------------  -----
3 non-null      int64
dtypes: int64(1)
memory usage: 156.0+ bytes

In [90]:
df.head() #데이터 처음 5개만 출력
df.tail() #데이터 마지막 5개만 출력

     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90

In [92]:
#df 데이터 복사하기 => 얕은복사
df2 = df
print(df)
print(df2)
df.columns=["m","e","mu","p"]

     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90
     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90

In [94]:
print(df)
print(df2)

      m   e   mu    p
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90
      m   e   mu    p
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90

In [97]:
#df 데이터 복사하기 => 깊은복사
df2 =df[:]
print(df)
print(df2)
df.columns=["수학","영어","음악","체육"]

      m   e   mu    p
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90
      m   e   mu    p
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90

In [107]:
#drop : 행 또는 열을 제거
# axis = 0 : 행을 의미
# axis = 1 : 컬럼을 의미
# 행제거
df2=df[:]
#df2.drop(["홍길동"],axis=0,inplace=True)
df2 = df2.drop(["홍길동"],axis=0)
print(df2)

     수학  영어   음악  체육
이몽룡  80  88   95  90
김삿갓  70  95  100  90

In [108]:
print(df)
print(df2)

     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90
     수학  영어   음악  체육
이몽룡  80  88   95  90
김삿갓  70  95  100  90

In [109]:
#체육 제거하기
df2 = df[:]
df2 = df2.drop(["체육"],axis=1)
print(df2)

     수학  영어   음악
홍길동  90  98   85
이몽룡  80  88   95
김삿갓  70  95  100

In [110]:
#열 제거
del df2["음악"]
print(df2)

     수학  영어
홍길동  90  98
이몽룡  80  88
김삿갓  70  95

In [111]:
df3 = df.copy() #깊은 복사
print(df3)

     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90

In [112]:
del df3["음악"],df3["체육"]

In [113]:
print(df3)

     수학  영어
홍길동  90  98
이몽룡  80  88
김삿갓  70  95

In [114]:
#drop 함수를 이용하여 음악,체육 과목 제거 하기
df4 = df.copy()
df4 = df4.drop(["음악","체육"],axis=1)
print(df4)

     수학  영어
홍길동  90  98
이몽룡  80  88
김삿갓  70  95

In [116]:
#문제 : 김삿갓, 이몽룡 데이터만 조회하기
df.loc[["김삿갓","이몽룡"]]
df.loc["이몽룡":"김삿갓"]

     수학  영어   음악  체육
이몽룡  80  88   95  90
김삿갓  70  95  100  90

In [119]:
#전체 데이터
df.loc[:]
df.iloc[:]

     수학  영어   음악   체육
홍길동  90  98   85  100
이몽룡  80  88   95   90
김삿갓  70  95  100   90

In [120]:
df.loc[::2]

     수학  영어   음악   체육
홍길동  90  98   85  100
김삿갓  70  95  100   90

In [121]:
df.loc[::-1]

     수학  영어   음악   체육
김삿갓  70  95  100   90
이몽룡  80  88   95   90
홍길동  90  98   85  100

In [122]:
df.iloc[::2]

     수학  영어   음악   체육
홍길동  90  98   85  100
김삿갓  70  95  100   90

In [123]:
df.iloc[::-1]

     수학  영어   음악   체육
김삿갓  70  95  100   90
이몽룡  80  88   95   90
홍길동  90  98   85  100

In [126]:
df[::2]

     수학  영어   음악   체육
홍길동  90  98   85  100
김삿갓  70  95  100   90

In [127]:
df[::-1]

     수학  영어   음악   체육
김삿갓  70  95  100   90
이몽룡  80  88   95   90
홍길동  90  98   85  100

In [130]:
#df[[0,3]]
df[["수학","영어"]]

     수학  영어
홍길동  90  98
이몽룡  80  88
김삿갓  70  95

In [132]:
#이몽룡의 수학,영어 점수 조회하기
df.loc["이몽룡"][["수학","영어"]] #Series 객체

수학    80
영어    88
Name: 이몽룡, dtype: int64

In [133]:
#이몽룡의 수학,영어 점수 조회하기
df.loc["이몽룡",["수학","영어"]] #Series 객체

수학    80
영어    88
Name: 이몽룡, dtype: int64

In [134]:
#이몽룡의 수학,영어 점수 조회하기
df.loc[["이몽룡"],["수학","영어"]] #DataFrame 객체
#df.loc[행의범위,열의범위]

     수학  영어
이몽룡  80  88

In [135]:
#이몽룡의 수학,영어 점수 조회하기
df.loc[["이몽룡"]][["수학","영어"]] #DataFrame 객체

     수학  영어
이몽룡  80  88

In [138]:
tatinic = pd.read_csv("./data/titanic.csv")
tatinic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 393 entries, 0 to 392
Data columns (total 13 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     393 non-null    int64
 1   survived   393 non-null    int64
 2   name       393 non-null    object
 3   sex        393 non-null    object
 4   age        305 non-null    float64
 5   sibsp      393 non-null    int64
 6   parch      393 non-null    int64
 7   ticket     393 non-null    object
 8   fare       393 non-null    float64
 9   cabin      81 non-null     object
 10  embarked   393 non-null    object
 11  body       36 non-null     float64
 12  home.dest  218 non-null    object
dtypes: float64(3), int64(4), object(6)
memory usage: 40.0+ KB

In [141]:
#excel 파일 읽기
sales = pd.read_excel("./data/sales_2013.xlsx",sheet_name="january_2013") #pip install openpyxl
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Customer ID     6 non-null      int64
 1   Customer Name   6 non-null      object
 2   Invoice Number  6 non-null      object
 3   Sale Amount     6 non-null      int64
 4   Purchase Date   6 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 372.0+ bytes

c:\Users\123rl\miniconda3\Lib\site-packages\openpyxl\worksheet\_reader.py:329: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

In [142]:
print(sales)

   Customer ID       Customer Name Invoice Number  Sale Amount Purchase Date
0         1234          John Smith       100-0002         1200    2013-01-01
1         2345       Mary Harrison       100-0003         1425    2013-01-06
2         3456          Lucy Gomez       100-0004         1390    2013-01-11
3         4567        Rupert Jones       100-0005         1257    2013-01-18
4         5678       Jenny Walters       100-0006         1725    2013-01-24
5         6789  Samantha Donaldson       100-0007         1995    2013-01-31

In [147]:
#print(tatinic)
#tatinic.head()
#tatinic.tail()
tatinic.tail(10)   #마지막 데이터 10개 조회

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,body,home.dest
383,1,0,"Compton, Mr. Alexander Taylor Jr",male,37.0,1,1,PC 17756,83.1583,E52,C,NaN,"Lakewood, NJ"
384,3,0,"Storey, Mr. Thomas",male,60.5,0,0,3701,24.2500,NaN,S,261.0,NaN
385,2,1,"Hold, Mrs. Stephen (Annie Margaret Hill)",female,29.0,1,0,26707,26.0000,NaN,S,NaN,"England / Sacramento, CA"
386,3,1,"Johnson, Miss. Eleanor Ileen",female,1.0,1,1,347742,11.1333,NaN,S,NaN,NaN
387,3,0,"Johnston, Master. William Arthur ""Willie""",male,NaN,1,2,W./C. 6607,23.4500,NaN,S,NaN,NaN
388,3,0,"Karlsson, Mr. Julius Konrad Eugen",male,33.0,0,0,347465,7.8542,NaN,S,NaN,NaN
389,2,1,"Ware, Mrs. John James (Florence Louise Long)",female,31.0,0,0,CA 31352,21.0000,NaN,S,NaN,"Bristol, England / New Britain, CT"
390,3,1,"O'Keefe, Mr. Patrick",male,NaN,0,0,368402,7.7500,NaN,Q,NaN,NaN
391,3,0,"Tobin, Mr. Roger",male,NaN,0,0,383121,7.7500,F38,Q,NaN,NaN
392,1,1,"Daniels, Miss. Sarah",female,33.0,0,0,113781,151.5500,NaN,S,NaN,NaN

In [186]:
#jeju1.csv 파일을 읽어 장소만 조회하기
jeju = pd.read_csv("data/jeju1.csv")

In [187]:
jeju.info()
print(jeju["장소"]) 
print(jeju[["장소"]])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   장소      11 non-null     object
 1   LON     11 non-null     float64
 2   LAT     11 non-null     float64
dtypes: float64(2), object(1)
memory usage: 396.0+ bytes
0          제주국제공항
1             돔베돈
2            공룡랜드
3          협재해수욕장
4            한림공원
5            유리의성
6         오설록티뮤지엄
7         테디베어뮤지엄
8         저녁_오성식당
9          중문관광단지
10    숙소_서귀포KAL호텔
Name: 장소, dtype: object
             장소
0        제주국제공항
1           돔베돈
2          공룡랜드
3        협재해수욕장
4          한림공원
5          유리의성
6       오설록티뮤지엄
7       테디베어뮤지엄
8       저녁_오성식당
9        중문관광단지
10  숙소_서귀포KAL호텔

In [188]:
#LON,LAT만 조회하기
print(jeju[["LON","LAT"]])

           LON        LAT
0   126.496217  33.505314
1   126.526687  33.516084
2   126.433153  33.442382
3   126.240463  33.404218
4   126.239262  33.390101
5   126.273744  33.315127
6   126.289451  33.306537
7   126.408691  33.267972
8   126.414549  33.256059
9   126.412361  33.249186
10  126.580954  33.248020

In [189]:
#print(jeju)
#장소 컬럼을 인덱스로 변경하기 : 
# set_index: 컬럼을 인덱스로 변경하기
jeju.set_index("장소",inplace=True)
print(jeju)

                    LON        LAT
장소
제주국제공항       126.496217  33.505314
돔베돈          126.526687  33.516084
공룡랜드         126.433153  33.442382
협재해수욕장       126.240463  33.404218
한림공원         126.239262  33.390101
유리의성         126.273744  33.315127
오설록티뮤지엄      126.289451  33.306537
테디베어뮤지엄      126.408691  33.267972
저녁_오성식당      126.414549  33.256059
중문관광단지       126.412361  33.249186
숙소_서귀포KAL호텔  126.580954  33.248020

In [190]:
jeju.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11 entries, 제주국제공항 to 숙소_서귀포KAL호텔
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   LON     11 non-null     float64
 1   LAT     11 non-null     float64
dtypes: float64(2)
memory usage: 264.0+ bytes

In [192]:
#jeju["장소"] #오류 발생. 인덱스로 전환. 장소 컬럼 없음
jeju.index

Index(['제주국제공항', '돔베돈', '공룡랜드', '협재해수욕장', '한림공원', '유리의성', '오설록티뮤지엄', '테디베어뮤지엄',
       '저녁_오성식당', '중문관광단지', '숙소_서귀포KAL호텔'],
      dtype='object', name='장소')

In [193]:
#돔베돈의 경도(LON),위도(LAT) 조회하기
print(jeju.loc["돔베돈"])

LON    126.526687
LAT     33.516084
Name: 돔베돈, dtype: float64

In [194]:
print(jeju.loc[["돔베돈"],["LON","LAT"]])

            LON        LAT
장소
돔베돈  126.526687  33.516084

In [195]:
print(jeju.loc["돔베돈"]["LON":"LAT"])

LON    126.526687
LAT     33.516084
Name: 돔베돈, dtype: float64

In [196]:
#여행지 컬럼 생성. df[새로운컬럼]=값들
#여행지 컬럼 수정. df[기존컬럼]=값들
jeju["여행지"]=jeju.index

In [197]:
jeju.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11 entries, 제주국제공항 to 숙소_서귀포KAL호텔
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   LON     11 non-null     float64
 1   LAT     11 non-null     float64
 2   여행지     11 non-null     object
dtypes: float64(2), object(1)
memory usage: 652.0+ bytes

In [198]:
jeju["여행지"]

장소
제주국제공항              제주국제공항
돔베돈                    돔베돈
공룡랜드                  공룡랜드
협재해수욕장              협재해수욕장
한림공원                  한림공원
유리의성                  유리의성
오설록티뮤지엄            오설록티뮤지엄
테디베어뮤지엄            테디베어뮤지엄
저녁_오성식당            저녁_오성식당
중문관광단지              중문관광단지
숙소_서귀포KAL호텔    숙소_서귀포KAL호텔
Name: 여행지, dtype: object

In [199]:
#인덱스를 컬럼으로 변경하기
jeju.reset_index(inplace=True)

In [200]:
jeju

             장소         LON        LAT          여행지
0        제주국제공항  126.496217  33.505314       제주국제공항
1           돔베돈  126.526687  33.516084          돔베돈
2          공룡랜드  126.433153  33.442382         공룡랜드
3        협재해수욕장  126.240463  33.404218       협재해수욕장
4          한림공원  126.239262  33.390101         한림공원
5          유리의성  126.273744  33.315127         유리의성
6       오설록티뮤지엄  126.289451  33.306537      오설록티뮤지엄
7       테디베어뮤지엄  126.408691  33.267972      테디베어뮤지엄
8       저녁_오성식당  126.414549  33.256059      저녁_오성식당
9        중문관광단지  126.412361  33.249186       중문관광단지
10  숙소_서귀포KAL호텔  126.580954  33.248020  숙소_서귀포KAL호텔

In [201]:
#장소 컬럼 제거하기
del jeju["장소"]
jeju

           LON        LAT          여행지
0   126.496217  33.505314       제주국제공항
1   126.526687  33.516084          돔베돈
2   126.433153  33.442382         공룡랜드
3   126.240463  33.404218       협재해수욕장
4   126.239262  33.390101         한림공원
5   126.273744  33.315127         유리의성
6   126.289451  33.306537      오설록티뮤지엄
7   126.408691  33.267972      테디베어뮤지엄
8   126.414549  33.256059      저녁_오성식당
9   126.412361  33.249186       중문관광단지
10  126.580954  33.248020  숙소_서귀포KAL호텔

In [203]:
#장소 컬럼 제거하기
jeju["장소"]=jeju["여행지"]
jeju.drop("장소",axis=1,inplace=True)
jeju

           LON        LAT          여행지
0   126.496217  33.505314       제주국제공항
1   126.526687  33.516084          돔베돈
2   126.433153  33.442382         공룡랜드
3   126.240463  33.404218       협재해수욕장
4   126.239262  33.390101         한림공원
5   126.273744  33.315127         유리의성
6   126.289451  33.306537      오설록티뮤지엄
7   126.408691  33.267972      테디베어뮤지엄
8   126.414549  33.256059      저녁_오성식당
9   126.412361  33.249186       중문관광단지
10  126.580954  33.248020  숙소_서귀포KAL호텔

In [205]:
#jeju 데이터를 csv 파일로 생성
#to_csv()
#index=False : 인덱스 제외하고 파일로 생성
#index=True : 기본값
#jeju.to_csv("data/df_jeju.csv") #인덱스 포함
jeju.to_csv("data/df_jeju.csv",index=False) #인덱스 제외

In [206]:
#df_jeju.csv 파일을 읽어 df에 저장하기
df = pd.read_csv("data/df_jeju.csv")
df

           LON        LAT          여행지
0   126.496217  33.505314       제주국제공항
1   126.526687  33.516084          돔베돈
2   126.433153  33.442382         공룡랜드
3   126.240463  33.404218       협재해수욕장
4   126.239262  33.390101         한림공원
5   126.273744  33.315127         유리의성
6   126.289451  33.306537      오설록티뮤지엄
7   126.408691  33.267972      테디베어뮤지엄
8   126.414549  33.256059      저녁_오성식당
9   126.412361  33.249186       중문관광단지
10  126.580954  33.248020  숙소_서귀포KAL호텔

In [208]:
#excel 파일 읽기 : 모든 sheet 읽기
# sheet_name=None : 모든 sheet를 읽기. {"sheet이름":DataFrame,...} 딕셔너리로 리턴
df=pd.read_excel("data/sales_2013.xlsx",sheet_name=None,index_col=None)
#print(df)
print(type(df))

<class 'dict'>

c:\Users\123rl\miniconda3\Lib\site-packages\openpyxl\worksheet\_reader.py:329: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)
c:\Users\123rl\miniconda3\Lib\site-packages\openpyxl\worksheet\_reader.py:329: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)
c:\Users\123rl\miniconda3\Lib\site-packages\openpyxl\worksheet\_reader.py:329: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

In [210]:
# df 의 sheet 이름들 조회하기
print(df.keys())

dict_keys(['january_2013', 'february_2013', 'march_2013'])

In [211]:
for name,data in df.items() :
    print("sheet 이름:",name)
    print(data)

sheet 이름: january_2013
   Customer ID       Customer Name Invoice Number  Sale Amount Purchase Date
0         1234          John Smith       100-0002         1200    2013-01-01
1         2345       Mary Harrison       100-0003         1425    2013-01-06
2         3456          Lucy Gomez       100-0004         1390    2013-01-11
3         4567        Rupert Jones       100-0005         1257    2013-01-18
4         5678       Jenny Walters       100-0006         1725    2013-01-24
5         6789  Samantha Donaldson       100-0007         1995    2013-01-31
sheet 이름: february_2013
   Customer ID   Customer Name Invoice Number  Sale Amount Purchase Date
0         9876   Daniel Farber       100-0008         1115    2013-02-02
1         8765     Laney Stone       100-0009         1367    2013-02-08
2         7654    Roger Lipney       100-0010         2135    2013-02-15
3         6543   Thomas Haines       100-0011         1346    2013-02-17
4         5432     Anushka Vaz       100-0012         1560    2013-02-21
5         4321  Harriet Cooper       100-0013         1852    2013-02-25
sheet 이름: march_2013
   Customer ID  Customer Name Invoice Number  Sale Amount Purchase Date
0         1234     John Smith       100-0014         1350    2013-03-04
1         8765      Tony Song       100-0015         1167    2013-03-08
2         2345  Mary Harrison       100-0016         1789    2013-03-17
3         6543     Rachel Paz       100-0017         2042    2013-03-22
4         3456     Lucy Gomez       100-0018         1511    2013-03-28
5         4321  Susan Wallace       100-0019         2280    2013-03-30

In [212]:
data

   Customer ID  Customer Name Invoice Number  Sale Amount Purchase Date
0         1234     John Smith       100-0014         1350    2013-03-04
1         8765      Tony Song       100-0015         1167    2013-03-08
2         2345  Mary Harrison       100-0016         1789    2013-03-17
3         6543     Rachel Paz       100-0017         2042    2013-03-22
4         3456     Lucy Gomez       100-0018         1511    2013-03-28
5         4321  Susan Wallace       100-0019         2280    2013-03-30

In [214]:
data["Sale Amount"] > 1500

0    False
1    False
2     True
3     True
4     True
5     True
Name: Sale Amount, dtype: bool

In [213]:
#Sale Amount 컬럼의 값이 1500 보다 큰 데이터들만 조회하기
data[data["Sale Amount"] > 1500]  #data["Sale Amount"] > 1500 의 결과가 True인 레코드만 조회

   Customer ID  Customer Name Invoice Number  Sale Amount Purchase Date
2         2345  Mary Harrison       100-0016         1789    2013-03-17
3         6543     Rachel Paz       100-0017         2042    2013-03-22
4         3456     Lucy Gomez       100-0018         1511    2013-03-28
5         4321  Susan Wallace       100-0019         2280    2013-03-30

In [215]:
data[[False,False,True,True,True,True]] #data 중 행의 값이 True인 행만 조회

   Customer ID  Customer Name Invoice Number  Sale Amount Purchase Date
2         2345  Mary Harrison       100-0016         1789    2013-03-17
3         6543     Rachel Paz       100-0017         2042    2013-03-22
4         3456     Lucy Gomez       100-0018         1511    2013-03-28
5         4321  Susan Wallace       100-0019         2280    2013-03-30

In [216]:
data.loc[data["Sale Amount"] > 1500]

   Customer ID  Customer Name Invoice Number  Sale Amount Purchase Date
2         2345  Mary Harrison       100-0016         1789    2013-03-17
3         6543     Rachel Paz       100-0017         2042    2013-03-22
4         3456     Lucy Gomez       100-0018         1511    2013-03-28
5         4321  Susan Wallace       100-0019         2280    2013-03-30

In [217]:
#문제 : data 중 Sale Amount 값이 2000 이상인 데이터를 data2000 에 저장하기

data2000 = data[data["Sale Amount"] > 2000]
data2000

   Customer ID  Customer Name Invoice Number  Sale Amount Purchase Date
3         6543     Rachel Paz       100-0017         2042    2013-03-22
5         4321  Susan Wallace       100-0019         2280    2013-03-30

In [226]:
#data2000을 pd_sales2000_2013.xlsx 파일로 저장하기
outexcel = pd.ExcelWriter("data/pd_sales2000_2013.xlsx") #빈 엑셀파일 생성
#data2000 를 201303_2000 sheet에 저장
data2000.to_excel(outexcel,sheet_name="201303_2000",index=False) 
#data 를 201303 sheet에 저장
data.to_excel(outexcel,sheet_name="201303",index=False)
outexcel.close()  #파일 닫기

In [230]:
#outexcel close() 함. 
#with 예약어로 파일을 열면, close() 구문이 없어도 됨.
with pd.ExcelWriter("data/pd_sales2000_2013_2.xlsx") as outexcel :
    data2000.to_excel(outexcel,sheet_name="201303_2000",index=False) 
    data.to_excel(outexcel,sheet_name="201303",index=False)

In [229]:
# 매입일자(Purchase Date) : 2013-03-17일인 데이터만 조회하기
data[data["Purchase Date"] == "2013-03-17"]
data.loc[data["Purchase Date"] == "2013-03-17"]

   Customer ID  Customer Name Invoice Number  Sale Amount Purchase Date
2         2345  Mary Harrison       100-0016         1789    2013-03-17

In [236]:
#dict_data 데이터 프레임 객체 생성하기. 인덱스:r0~r2 설정하기
df = pd.DataFrame(dict_data, index=["r0","r1","r2"])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [237]:
#오류 발생. 행의 갯수가 틀림
#df.index=["r0","r1","r2","r3"]
ndf = df.reindex(["r0","r1","r2","r3"])
ndf
#NaN : 결측값. 값이 없음

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN

In [238]:
#df의 행을 늘리는데 0으로 채우기.
zdf = df.reindex(["r0","r1","r2","r3"],fill_value=0)
zdf

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0

In [239]:
zdf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, r0 to r3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c0      4 non-null      int64
 1   c1      4 non-null      int64
 2   c2      4 non-null      int64
 3   c3      4 non-null      int64
 4   c4      4 non-null      int64
dtypes: int64(5)
memory usage: 192.0+ bytes

In [242]:
#sort_index : 인덱스 기준 정렬 
#ascending=True : 오름차순 정렬
#ascending=False : 내림차순 정렬
print(df.sort_index(ascending=False))
df

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [244]:
#컬럼 기준으로 정렬.
print(zdf.sort_values(by="c1",ascending=False))
print(zdf.sort_values(by="c1",ascending=True))

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13
r3   0   0   0   0   0
    c0  c1  c2  c3  c4
r3   0   0   0   0   0
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [245]:
exam_data={"이름":["서준","우현","인아"],
           "수학":[90,80,70],
           "영어":[98,89,95],
           "음악":[85,95,100],
           "체육":[100,90,90]}

In [247]:
#1. exam_data로 DataFrame 객체 생성하기
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [248]:
#2. 이름 컬럼을 인덱스로 만들기
df.set_index("이름",inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [249]:
#3. 이름의 역순으로 정렬하기
df.sort_index(ascending=False)

    수학  영어   음악   체육
이름
인아  70  95  100   90
우현  80  89   95   90
서준  90  98   85  100

In [250]:
#4. 영어 점수의 역순으로 정렬하기
df.sort_values(by="영어",ascending=False)

    수학  영어   음악   체육
이름
서준  90  98   85  100
인아  70  95  100   90
우현  80  89   95   90

In [251]:
#총점 컬럼을 생성하여, 수학,영어,음악,체육 점수의 합을 저장하기
df["총점"]=df["수학"]+df["영어"]+df["음악"]+df["체육"]
df

    수학  영어   음악   체육   총점
이름
서준  90  98   85  100  373
우현  80  89   95   90  354
인아  70  95  100   90  355

In [253]:
#총점의 역순으로 출력하기
df.sort_values(by="총점",ascending=False)

    수학  영어   음악   체육   총점
이름
서준  90  98   85  100  373
인아  70  95  100   90  355
우현  80  89   95   90  354

In [255]:
#titanic 데이터셋 예제
import pandas as pd
#seaborn : 시각화모듈. 학습데이터 저장
import seaborn as sns #pip install seaborn

In [256]:
#seaborn에 저장된 데이터 셋의 이름
print(sns.get_dataset_names())

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'dowjones', 'exercise', 'flights', 'fmri', 'geyser', 'glue', 'healthexp', 'iris', 'mpg', 'penguins', 'planets', 'seaice', 'taxis', 'tips', 'titanic']

survived	생존여부
pclass	좌석등급 (숫자)
sex	성별 (male, female)
age	나이
sibsp	형제자매 + 배우자 인원수
parch: 	부모 + 자식 인원수
fare: 	요금
embarked	탑승 항구
class	좌석등급 (영문)
who	성별 (man, woman)
adult_male 성인남자여부 
deck	선실 고유 번호 가장 앞자리 알파벳
embark_town	탑승 항구 (영문)
alive	생존여부 (영문)
alone	혼자인지 여부

In [257]:
titanic = sns.load_dataset("titanic")
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [258]:
#pclass,class 데이터의 처음 10개의 레코드만 조회하기
titanic[["pclass","class"]].head(10)

   pclass   class
0       3   Third
1       1   First
2       3   Third
3       1   First
4       3   Third
5       3   Third
6       1   First
7       3   Third
8       3   Third
9       2  Second

In [259]:
#각 컬럼별 결측값을 제외한 데이터의 건수
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [261]:
#컬럼 중 건수가 가장 작은 건수 출력하기
print(titanic.count().min())
#컬럼 중 건수가 가장 작은 건수의 인덱스 출력하기
print(titanic.count().idxmin())

203
deck

In [262]:
#titanic의 age,fare 컬럼만 df 데이터에 저장하기
df=titanic[["age","fare"]]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [263]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     714 non-null    float64
 1   fare    891 non-null    float64
dtypes: float64(2)
memory usage: 14.1 KB

In [264]:
#df 데이터의 평균출력하기
df.mean()

age     29.699118
fare    32.204208
dtype: float64

In [265]:
#최대 나이, 최소나이를 조회하기
print("최대나이:",df.age.max())
print("최소나이:",df.age.min())

최대나이: 80.0
최소나이: 0.42

In [267]:
#나이별 인원수 조회. 
#value_counts() : 데이터별 레코드 건수를 건수의 내림차순으로 정렬 출력
df.age.value_counts()
print(type(df.age.value_counts()))

<class 'pandas.core.series.Series'>

In [269]:
#인원수가 많은 나이 10개 조회하기
df.age.value_counts().head(10)

age
24.0    30
22.0    27
18.0    26
28.0    25
30.0    25
19.0    25
21.0    24
25.0    23
36.0    22
29.0    20
Name: count, dtype: int64

In [271]:
#승객 중 최고령자 정보 조회하기
print(df[df["age"]==df["age"].max()])
print(titanic[df["age"]==df["age"].max()])

      age  fare
630  80.0  30.0
     survived  pclass   sex   age  sibsp  parch  fare embarked  class  who  \
630         1       1  male  80.0      0      0  30.0        S  First  man

     adult_male deck  embark_town alive  alone
630        True    A  Southampton   yes   True

In [274]:
#titanic 데이터에서 생존인원수와 사망인원수 조회하기
print(titanic["survived"].value_counts())
print(titanic["alive"].value_counts())

survived
0    549
1    342
Name: count, dtype: int64
alive
no     549
yes    342
Name: count, dtype: int64

In [275]:
#성별 인원수 조회하기
print(titanic["sex"].value_counts())
print(titanic["who"].value_counts())

sex
male      577
female    314
Name: count, dtype: int64
who
man      537
woman    271
child     83
Name: count, dtype: int64

In [276]:
#성별로 생존 건수 조회하기
cnt = titanic[["sex","survived"]].value_counts()
print(cnt)

sex     survived
male    0           468
female  1           233
male    1           109
female  0            81
Name: count, dtype: int64

In [277]:
cnt = titanic[["who","survived"]].value_counts()
print(cnt)

who    survived
man    0           449
woman  1           205
man    1            88
woman  0            66
child  1            49
       0            34
Name: count, dtype: int64

In [280]:
print(type(cnt))
print(cnt.index)

<class 'pandas.core.series.Series'>
MultiIndex([(  'man', 0),
            ('woman', 1),
            (  'man', 1),
            ('woman', 0),
            ('child', 1),
            ('child', 0)],
           names=['who', 'survived'])

컬럼 : 변수,피처 용어사용
빅데이터 특징
  3V
  1. Volume(규모) : 데이터 양이 많다
  2. Velocity(속도) : 처리 속도가 빨라야 한다.
  3. Variety(다양성) : 데이터의 형태가 다양함
      정형데이터 : 데이터베이스, csv, excel, 표데이터
      반정형 데이터 : json, xml, html,....
      비정형 데이터 : 동영상, 이미지

In [282]:
#상관계수 : -1 ~ 1 사이의 값. 컬럼들 사이의 상관관계를 수치로 표현함
#          한개의 컬럼의 값이 1이 변경되면 다른 컬럼도 1이 변경되는 경우 1    

titanic[["survived","age"]].corr()

          survived       age
survived  1.000000 -0.077221
age      -0.077221  1.000000

mpg : 연비
cylinders : 실린더 수
displacement : 배기량
horsepower : 출력
weight : 차량무게
acceleration : 가속능력
model_year : 출시년도
origin : 제조국
name : 모델명

In [283]:
#연비 데이터 seaborn 에서 가져오기
mpg = sns.load_dataset("mpg")
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [284]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    object
 8   name          398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

In [285]:
#제조국별 자동차 건수 조회하기
mpg.origin.value_counts()

origin
usa       249
japan      79
europe     70
Name: count, dtype: int64

In [286]:
#unique() : 중복없이 데이터 조회하기
mpg.origin.unique()

array(['usa', 'japan', 'europe'], dtype=object)

In [288]:
#출시년도 데이터를 중복없이 조회하기
mpg.model_year.unique()
mpg.model_year.value_counts()

model_year
73    40
78    36
76    34
82    31
75    30
80    29
79    29
81    29
70    29
71    28
72    28
77    28
74    27
Name: count, dtype: int64

In [289]:
mpg.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000

In [290]:
mpg.describe(include="all")

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000,398,398
unique,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3,305
top,NaN,NaN,NaN,NaN,NaN,NaN,NaN,usa,ford pinto
freq,NaN,NaN,NaN,NaN,NaN,NaN,NaN,249,6
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050,NaN,NaN
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627,NaN,NaN
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000,NaN,NaN
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000,NaN,NaN
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000,NaN,NaN
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000,NaN,NaN
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000,NaN,NaN

In [294]:
mpg.shape  #(행,열)
mpg.shape[0]  #행의 갯수
mpg.shape[1]  #열의 갯수
mpg.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower      float64
weight            int64
acceleration    float64
model_year        int64
origin           object
name             object
dtype: object

In [295]:
print(type(mpg.dtypes))

<class 'pandas.core.series.Series'>

In [297]:
#mpg 컬럼의 자료형 조회하기
mpg.dtypes["mpg"]
mpg["mpg"].dtypes

dtype('float64')

In [302]:
#최대 연비를 가진 자동차의 정보 조회하기
print(mpg[mpg["mpg"] == mpg.mpg.max()])
#최소 연비를 가진 자동차의 정보 조회하기
print(mpg[mpg["mpg"] == mpg.mpg.min()])

      mpg  cylinders  displacement  horsepower  weight  acceleration  \
322  46.6          4          86.0        65.0    2110          17.9

     model_year origin       name
322          80  japan  mazda glc
    mpg  cylinders  displacement  horsepower  weight  acceleration  \
28  9.0          8         304.0       193.0    4732          18.5

    model_year origin      name
28          70    usa  hi 1200d